app/controllers/api/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_city
    @city = City.find params[:id]