app/controllers/api/services_controller.rb

DELETE FROM "services" WHERE "services"."id" = ?  [["id", 1]]
INSERT INTO "services" ("name", "description", "duration", "how_to_get", "included", "max_clients", "min_clients", "not_included", "physical_effort", "place", "price", "adrenaline", "image", "restrictions", "short_description", "latitude", "city_id", "professional_id", "aproved", "collective", "event") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "service_pictures" ("public_id", "service_id") VALUES (?, ?)  [["public_id", "ksvxt5xwukrs0e0qdcb0"], ["service_id", 10]]
INSERT INTO "additionals" ("description", "excess", "service_id") VALUES (?, ?, ?)  [["description", "com tubaroes"], ["excess", 500], ["service_id", 18]]
---
  def create
    s_params = service_params
    additionals = s_params.delete(:additionals)
    pictures = s_params.delete(:service_pictures_attributes)
    @service = Service.create s_params
    pictures.each do |service_picture|
      picture = ServicePicture.new service_picture
      picture.service_id = @service.id
      picture.save
    end
    additionals.to_a.each do |additional|
      additional = Additional.new additional
      additional.service_id = @service.id
      additional.save

SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", 3]]
---
  def set_service
    @service = Service.find params[:id]