app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "rqs111193@gmail.com"]]
SELECT  "professionals".* FROM "professionals" WHERE "professionals"."email" = ? LIMIT 1  [["email", "rqs111193@gmail.com"]]
---
    def create
        user = User.find_by(email: session_params[:email])
        if user
            professional = Professional.find_by(email: session_params[:email])