app/controllers/api/sports_controller.rb

SELECT "sports".* FROM "sports"
---
  def set_sport
    @sport = Sport.find params[:id]