app/controllers/api/users_controller.rb

  def create
    @user = User.create user_params
---
INSERT INTO "users" ("name", "email", "password_digest", "token") VALUES (?, ?, ?, ?)  [["name", "joao"], ["email", "joao@gmail.com"], ["password_digest", "1234"], ["token", "XBfzefKhyDggLb75ZYhUNvm4"]]

  def set_user
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]